export enum KronaExpertResponseComparableFieldNames {
  /** Галочка "В расчет" */
  IS_ACTIVE = "В расчет",
  /** Ссылка на объявление */
  INFO_LINK = "Ссылка на объявление",
  /** Гиперссылка */
  HYPERLINK = "Гиперссылка",
  /** Полный адрес */
  ADDRESS = "Полный адрес",
  /** Цена предложения */
  PRICE = "Цена предложения",
  /** Корректировка на ТОРГ */
  BARGAIN = "Торг",
  /** Материал Стен */
  WALLS_MATERIAL = "материал стен",
  /** Год постройки */
  BUILD_YEAR = "Год постройки",
  /** Квартал (для новостроек) */
  BUILD_QUARTER = "",
  /** Этажность дома */
  STOREYS = "Этажность дома",
  /** Этаж расположения квартиры */
  FLOOR = "расположения",
  /** Кол-во комнат в квартире */
  ROOMS_COUNT = "комнат в квартире",
  /** Состояние отделки */
  REPAIRS_TYPE = "Состояние отделки",
  /** Общая площадь */
  TOTAL_SPACE = "Общая площадь",
  /** Площадь кухни */
  KITCHEN_SPACE = "Площадь кухни",
  /** Наличие мебели */
  FURNITURE = "Наличие мебели",
}
