/** Переведенные на русский Енамы для поля "Статус" на странице
 * https://test.srg-it.ru/9r/requests
 */
export enum KronaEnumResidentialRequestsStatusTranslated {
  /**   * Статус = "Принят"   */
  CREATED = "Принят",
  /**   * Статус = "Оценивается"   */
  AWAITS_AUTO_VALUATION = "Оценивается",
  /**   * Статус = "Одобрен"   */
  ACCEPTED_AUTO_VALUATION = "Одобрен",
  /**   * Статус = "Скорректировано"   */
  OVERVALUATION = "Скорректировано",
  /**   * Статус = "Не оценивается"   */
  NOT_EVALUATED = "Не оценивается",
  /**   * Статус = "Окончание верификации ... по МСК"   */
  AWAITS_EXPERT_VALUATION = "Окончание верификации ... по МСК",
  /**   * Статус = "Требует верификации до ... по МСК"   */
  BANK_SELF_EXPERT_VERIFICATION = "Требует верификации до ... по МСК",
  /**   * Статус = "Ошибка в запросе"   */
  INVALID_FOR_EXPERT_VALUATION = "Ошибка в запросе",
  /**   * Статус = "Одобрено экспертом"   */
  ACCEPTED_EXPERT_VALUATION = "Одобрено экспертом",
  /**   * Статус = "Ошибка при автоматической оценке"   */
  FAILED_AUTO_VALUATION = "Ошибка при автоматической оценке",
  /**   * Статус = "Не оценивается"   */
  INVALID = "Не оценивается",
  /**   * Статус = "Отменён"   */
  CANCELED = "Отменён",
  /**   * Статус = "Не подлежит оценке"   */
  SHOULD_NOT_BE_EVALUATED = "Не подлежит оценке",
}
