/** enums для того, чтобы выводить в лог информацию о том, на какое окно будет совершено переключение */
export enum EnumSwitchWindow {
  /** Переключение на окно Байкала */
  switch_to_baikal = "Переключение на окно Байкала",
  /** Переключение на окно КРОНЫ */
  switch_to_9r = "Переключение на окно КРОНЫ",
  /** Переключение на окно ЦИАН */
  switch_to_cian = "Переключение на окно ЦИАН",
  /** Переключение на окно Яндекс */
  switch_to_yandex = "Переключение на окно Яндекс",
  /** Переключение на окно Авито */
  switch_to_avito = "Переключение на окно Авито",
  /** Переключение на окно Домофонд */
  switch_to_domofond = "Переключение на окно Домофонд",
}
