export enum BaResidentialBanks {
  /** Банк "Другие" */
  OTHER = "other",
  /** Райффайзен */
  RAF = "raf",
  /** Уральский банк развития */
  UBRR = "105",
  /** SRG */
  SRG = "1",
  /** Альфабанк_id88 */
  ALFABANK = "88",
  /** «Кредит Урал Банк» (АО) */
  CREDIT_URAL_BANK = "97",
  /** Транскапитал банк */
  TRANSCAPITAL = "85",
  /** АО Банк «Северный морской путь» */
  SMP_BANK = "111",
  /** «Банк Жилищного Финансирования» */
  BJF = "122",
  /** ПАО «Совкомбанк» */
  SOVKOMBANK = "47",
  /** Банк "ТРАСТ" (ПАО) */
  TRAST_BANK = "145",
  /** СКБ Приморья «Примсоцбанк» (ОАО) */
  PRIMSOCBANK = "36",
  /** ПАО «МТС-Банк» */
  MTS_BANK = "132",
  /** ПАО «Банк «Санкт-Петербург» */
  SPB_BANK = "8",
  /** ПАО "МИнБанк" */
  MINBANK = "117",
  /** АО ЮниКредит Банк */
  UNICREDIT = "51",
  /** АО БАНК ДОМ.РФ */
  DOMRF = "7",
  /** Хлынов */
  KHLUNOV = "113",
  /** ХоумКред */
  HOMECREDIT = "18",
  /** Газпромбанк */
  GAZPROMBANK = "96",
  /** ПАО "БАНК УРАЛСИБ" */
  URALSIB = "52",
  /** АО "АИЖК" */
  ARHML = "79",
  /** Траст тест */
  TRAST_TEST = "121",
  /** АО «АБ «РОССИЯ» */
  AB_RUSSIA = "86",
  /** Тестовый сбербанк для конкурса */
  SBERBANK_TEST_COMPETITION = "1001",
  /** АО "Россельхозбанк" */
  ROSSELHOZBANK = "45",
  /** ПАО «Промсвязьбанк» */
  PROMSVYAZBANK = "83",
  /** ВТБ */
  VTB = "54",
  /** Тинькофф */
  TINKOFF = "103",
  /** ПАО АКБ «Связь-Банк» */
  SVYAZBANK = "127",
  /** АКБ «Абсолют Банк» (ОАО) */
  ABSOLUTEBANK = "2",
  /** ПАО АКБ "Металлинвестбанк" */
  METALINVEST = "76",
  /** ПАО Банк «ФК Открытие» */
  OPENBANK = "32",
  /** Возрождение */
  VOZROZHDENIE = "voz",
  /** Запсибкомбанк */
  ZAPSIB = "zsk",
  /** РНКБ банк */
  RNKB_BANK = "92",
  /** Модуль банк */
  MODULE_BANK = "202",
  /** Мани мэн банк */
  MONEY_MAN = "203",
  /** Московский кредитный банк */
  MKB = "208",
  /** АКБАРС банк */
  AK_BARS = "5",
}
