/** Поле данных аналога для установки
 * или получения информации по ним
 *
 */
export enum BaAnalogDataField {
  /** Город */
  CITY = "Город",
  /** Адрес */
  ADDRESS = "Адрес",
  /** Комнат */
  ROOMS = "Комнат",
  /** Общая площадь */
  SPACE_TOTAL = "Общая",
  /** Жилая площадь */
  SPACE_LIVING = "Жилая",
  /** Площадь кухни */
  SPACE_KITCHEN = "Площадь кухни",
  /** Балкон */
  BALCONY = "Балкон",
  /** Сан узел */
  TOILET = "Сан. узел",
  /** Вид из окна */
  WINDOW_VIEW = "Вид из окна",
  /** Состояние отделки */
  REPAIR_STATE = "Состояние отделки",
  /** Этаж расположения */
  FLOOR = "Этаж",
  /** Год постройки */
  BUILD_YEAR = "Год постройки",
  /** Материал стен */
  WALLS_MATERIAL = "Материал стен",
  /** Этажность */
  STOREYS = "Этажность",
  /** Цена */
  PRICE = "Цена",
  /** Вид сделки */
  DEAL_TYPE = "Вид сделки",
  /** Контактная информация */
  CONTACT_INFORMATION = "Контактная",
  /** Ссылка в интернете */
  URL = "Ссылка",
  /** Комментарии к фотографиям */
  PHOTOS_COMMENT = "Комментарии",
}
